In [60]:
# import the lib
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [61]:
# load the dataset
data = pd.read_csv('Social_Network_Ads.csv')
print('Data loaded')

Data loaded

In [62]:
data

      User ID  Gender  Age  EstimatedSalary  Purchased
0    15624510    Male   19            19000          0
1    15810944    Male   35            20000          0
2    15668575  Female   26            43000          0
3    15603246  Female   27            57000          0
4    15804002    Male   19            76000          0
..        ...     ...  ...              ...        ...
395  15691863  Female   46            41000          1
396  15706071    Male   51            23000          1
397  15654296  Female   50            20000          1
398  15755018    Male   36            33000          0
399  15594041  Female   49            36000          1

[400 rows x 5 columns]

In [63]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   User ID          400 non-null    int64
 1   Gender           400 non-null    object
 2   Age              400 non-null    int64
 3   EstimatedSalary  400 non-null    int64
 4   Purchased        400 non-null    int64
dtypes: int64(4), object(1)
memory usage: 15.8+ KB

In [64]:
data.describe()

            User ID         Age  EstimatedSalary   Purchased
count  4.000000e+02  400.000000       400.000000  400.000000
mean   1.569154e+07   37.655000     69742.500000    0.357500
std    7.165832e+04   10.482877     34096.960282    0.479864
min    1.556669e+07   18.000000     15000.000000    0.000000
25%    1.562676e+07   29.750000     43000.000000    0.000000
50%    1.569434e+07   37.000000     70000.000000    0.000000
75%    1.575036e+07   46.000000     88000.000000    1.000000
max    1.581524e+07   60.000000    150000.000000    1.000000

In [65]:
# check how many purchased
data['Purchased'].value_counts()

0    257
1    143
Name: Purchased, dtype: int64

In [66]:
# Gender using encoding
gender = pd.get_dummies(data['Gender'], drop_first=True)
gender

     Male
0       1
1       1
2       0
3       0
4       1
..    ...
395     0
396     1
397     0
398     1
399     0

[400 rows x 1 columns]

In [67]:
df = pd.concat([data, gender], axis=1)

In [68]:
df

      User ID  Gender  Age  EstimatedSalary  Purchased  Male
0    15624510    Male   19            19000          0     1
1    15810944    Male   35            20000          0     1
2    15668575  Female   26            43000          0     0
3    15603246  Female   27            57000          0     0
4    15804002    Male   19            76000          0     1
..        ...     ...  ...              ...        ...   ...
395  15691863  Female   46            41000          1     0
396  15706071    Male   51            23000          1     1
397  15654296  Female   50            20000          1     0
398  15755018    Male   36            33000          0     1
399  15594041  Female   49            36000          1     0

[400 rows x 6 columns]

In [69]:
# create independent & dependent variables
X = df[['Age', 'EstimatedSalary', 'Male']]
y = df['Purchased']

In [70]:
X

     Age  EstimatedSalary  Male
0     19            19000     1
1     35            20000     1
2     26            43000     0
3     27            57000     0
4     19            76000     1
..   ...              ...   ...
395   46            41000     0
396   51            23000     1
397   50            20000     0
398   36            33000     1
399   49            36000     0

[400 rows x 3 columns]

In [71]:
y

0      0
1      0
2      0
3      0
4      0
      ..
395    1
396    1
397    1
398    0
399    1
Name: Purchased, Length: 400, dtype: int64

In [72]:
# Apply scaling 
from sklearn.preprocessing import StandardScaler
sc = StandardScaler()

In [73]:
# split the data
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)

In [74]:
# apply scaling
X_train = sc.fit_transform(X_train)
X_test = sc.fit_transform(X_test)

In [75]:
# Apply KNN classifier
from sklearn.neighbors import KNeighborsClassifier
knn = KNeighborsClassifier()

In [76]:
# training
knn.fit(X_train, y_train)
y_pred = knn.predict(X_test)

In [80]:
# Evaluate the algo
from sklearn.metrics import confusion_matrix, accuracy_score, classification_report
print(confusion_matrix(y_test, y_pred))

[[48  4]
 [ 2 26]]

In [81]:
print(accuracy_score(y_test, y_pred))

0.925

In [82]:
print(classification_report(y_test, y_pred))

              precision    recall  f1-score   support

           0       0.96      0.92      0.94        52
           1       0.87      0.93      0.90        28

    accuracy                           0.93        80
   macro avg       0.91      0.93      0.92        80
weighted avg       0.93      0.93      0.93        80

In [83]:
# save the model
import joblib
joblib.dump(knn, 'purchase_pred.pkl')
print('model saved')

model saved

In [84]:
# load the model
model = joblib.load('purchase_pred.pkl')
print('model loaded')

model loaded

In [91]:
age = 41
salary = 23000
gend = 1 # male

result = model.predict(sc.transform([[age, salary, gend]]))

if result == 1:
    print('will purchase')
else:
    print('will not purchase')

will purchase

/usr/local/lib/python3.10/site-packages/sklearn/base.py:465: UserWarning: X does not have valid feature names, but StandardScaler was fitted with feature names
  warnings.warn(